# Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.

def func1(x, y):
    return x ** abs(y)


print(func1(2, -2))


def func2(x, y):
    res = 1
    for i in range(abs(y)):
        res *= x
    return res


print(func2(3, -2))
